# TASK1: Data Loading

In [20]:
#1
#Load the employees.csv file into a Pandas DataFrame. 
import pandas as pd
df= pd.read_csv('employees.csv')

In [21]:
#Display the first 10 rows of the dataset. 
df.head(10)

,Employee_ID,Name,Age,Department,Salary,Joining_Date,Resigned
0,1001,Steven Dunn,30.0,IT,46846.0,09/06/2024,False
1,1002,Jennifer Romero,54.0,IT,43585.0,07/02/2018,False
2,1003,Dana Haney,59.0,Finance,NaN,11/01/2019,False
3,1004,Louis Powers,60.0,Finance,58094.0,26/09/2019,False
4,1005,Jennifer Gilmore,54.0,Marketing,80848.0,09/02/2020,False
5,1006,Joshua Shelton,31.0,HR,69143.0,24/08/2021,True
6,1007,Thomas Lopez,39.0,HR,66678.0,24/05/2015,False
7,1008,Derrick Simmons,39.0,Finance,67837.0,23/06/2023,True
8,1009,Lori Short,56.0,IT,58575.0,28/02/2015,True
9,1010,Michael Foley,29.0,IT,54935.0,03/06/2020,True

# TASK2: Data Cleaning

In [22]:
#1
#Identify columns with missing values. 
df.isnull()

    Employee_ID   Name    Age  Department  Salary  Joining_Date  Resigned
0         False  False  False       False   False         False     False
1         False  False  False       False   False         False     False
2         False  False  False       False    True         False     False
3         False  False  False       False   False         False     False
4         False  False  False       False   False         False     False
..          ...    ...    ...         ...     ...           ...       ...
95        False  False  False       False   False         False     False
96        False  False  False       False   False         False     False
97        False  False  False       False   False         False     False
98        False  False  False       False   False         False     False
99        False  False   True       False   False         False     False

[100 rows x 7 columns]

In [23]:
#Fill missing values in the Age column with the median age.
median_age= df['Age'].median()
df.fillna({'Age' : median_age}, inplace=True)
print(df)

    Employee_ID               Name   Age Department   Salary Joining_Date  \
0          1001        Steven Dunn  30.0         IT  46846.0   09/06/2024
1          1002    Jennifer Romero  54.0         IT  43585.0   07/02/2018
2          1003         Dana Haney  59.0    Finance      NaN   11/01/2019
3          1004       Louis Powers  60.0    Finance  58094.0   26/09/2019
4          1005   Jennifer Gilmore  54.0  Marketing  80848.0   09/02/2020
..          ...                ...   ...        ...      ...          ...
95         1096        John Walton  28.0         IT  52401.0   13/08/2017
96         1097  Matthew Alexander  25.0         IT  61221.0   18/11/2018
97         1098         Kelly Cole  25.0         HR  69045.0   14/07/2018
98         1099     Melissa Harper  52.0         IT  61606.0   20/10/2022
99         1100      Paul Price MD  45.5  Marketing  42862.0   27/12/2017

    Resigned
0      False
1      False
2      False
3      False
4      False
..       ...
95      True
96     False
97     False
98      True
99     False

[100 rows x 7 columns]

In [24]:
#Fill missing values in the Salary column with the mean salary. 
mean_salary= df['Salary'].mean()
df.fillna({'Salary': mean_salary}, inplace=True)
print(df)

    Employee_ID               Name   Age Department        Salary  \
0          1001        Steven Dunn  30.0         IT  46846.000000
1          1002    Jennifer Romero  54.0         IT  43585.000000
2          1003         Dana Haney  59.0    Finance  59643.923913
3          1004       Louis Powers  60.0    Finance  58094.000000
4          1005   Jennifer Gilmore  54.0  Marketing  80848.000000
..          ...                ...   ...        ...           ...
95         1096        John Walton  28.0         IT  52401.000000
96         1097  Matthew Alexander  25.0         IT  61221.000000
97         1098         Kelly Cole  25.0         HR  69045.000000
98         1099     Melissa Harper  52.0         IT  61606.000000
99         1100      Paul Price MD  45.5  Marketing  42862.000000

   Joining_Date  Resigned
0    09/06/2024     False
1    07/02/2018     False
2    11/01/2019     False
3    26/09/2019     False
4    09/02/2020     False
..          ...       ...
95   13/08/2017      True
96   18/11/2018     False
97   14/07/2018     False
98   20/10/2022      True
99   27/12/2017     False

[100 rows x 7 columns]

In [25]:
#2
#Check for duplicate rows and remove them if any exist. 
a= df.drop_duplicates(inplace=True)
print(a)

None

In [26]:
#3
#Convert all column names to lowercase for consistency. 
low= df.columns.str.lower()
print(low)

Index(['employee_id', 'name', 'age', 'department', 'salary', 'joining_date',
       'resigned'],
      dtype='object')

In [27]:
#4
#Convert all the column’s data type to the most relevant data type. 
print(df.convert_dtypes().dtypes)

Employee_ID              Int64
Name            string[python]
Age                    Float64
Department      string[python]
Salary                 Float64
Joining_Date    string[python]
Resigned               boolean
dtype: object

# TASK3: Data Manipulation

In [28]:
#1
#Filter out employees who are above the age of 25 or have a salary above 40,000, and are not resigned.
filter = df[(df['Age'] > 25) | (df['Salary'] > 40000) | (df['Resigned'] == False)]
print(filter)

    Employee_ID               Name   Age Department        Salary  \
0          1001        Steven Dunn  30.0         IT  46846.000000
1          1002    Jennifer Romero  54.0         IT  43585.000000
2          1003         Dana Haney  59.0    Finance  59643.923913
3          1004       Louis Powers  60.0    Finance  58094.000000
4          1005   Jennifer Gilmore  54.0  Marketing  80848.000000
..          ...                ...   ...        ...           ...
95         1096        John Walton  28.0         IT  52401.000000
96         1097  Matthew Alexander  25.0         IT  61221.000000
97         1098         Kelly Cole  25.0         HR  69045.000000
98         1099     Melissa Harper  52.0         IT  61606.000000
99         1100      Paul Price MD  45.5  Marketing  42862.000000

   Joining_Date  Resigned
0    09/06/2024     False
1    07/02/2018     False
2    11/01/2019     False
3    26/09/2019     False
4    09/02/2020     False
..          ...       ...
95   13/08/2017      True
96   18/11/2018     False
97   14/07/2018     False
98   20/10/2022      True
99   27/12/2017     False

[100 rows x 7 columns]

In [29]:
#2
#Create a new column YearsInCompany by calculating the number of years each employee has worked in the company (from JoiningDate to today). 
from datetime import datetime
# Convert the 'joining_date' column to datetime format with the correct date format
df['Joining_Date'] = pd.to_datetime(df['Joining_Date'], format='%d/%m/%Y', errors='coerce')

# Calculate the number of years each employee has worked in the company
df['years_in_company'] = (datetime.now() - df['Joining_Date']).dt.days // 365

print(df['years_in_company'])

0     0
1     6
2     6
3     5
4     4
     ..
95    7
96    6
97    6
98    2
99    7
Name: years_in_company, Length: 100, dtype: int64

In [30]:
#3
#Group employees by Department and calculate the average Salary and median Age for each department. 
grouping= df.groupby('Department').agg({'Salary': 'mean', 'Age': 'median'}).reset_index()
print(grouping)

  Department        Salary   Age
0    Finance  58612.570938  45.5
1         HR  60466.443028  45.0
2         IT  57740.778872  46.5
3  Marketing  62476.088587  45.5

In [31]:
#4
#ncrease the Salary of all employees in the IT department by 10%. 
df.loc[df['Department'] == 'IT', 'Salary'] *= 1.10
print(df['Salary'])

0     51530.600000
1     47943.500000
2     59643.923913
3     58094.000000
4     80848.000000
          ...
95    57641.100000
96    67343.100000
97    69045.000000
98    67766.600000
99    42862.000000
Name: Salary, Length: 100, dtype: float64

# TASK4: Data  Transformation

In [32]:
#1
#Rename the resigned column to is_resigned. 
df.rename(columns = {'Resigned' : 'is_resigned'}, inplace = True)
print(df)

    Employee_ID               Name   Age Department        Salary  \
0          1001        Steven Dunn  30.0         IT  51530.600000
1          1002    Jennifer Romero  54.0         IT  47943.500000
2          1003         Dana Haney  59.0    Finance  59643.923913
3          1004       Louis Powers  60.0    Finance  58094.000000
4          1005   Jennifer Gilmore  54.0  Marketing  80848.000000
..          ...                ...   ...        ...           ...
95         1096        John Walton  28.0         IT  57641.100000
96         1097  Matthew Alexander  25.0         IT  67343.100000
97         1098         Kelly Cole  25.0         HR  69045.000000
98         1099     Melissa Harper  52.0         IT  67766.600000
99         1100      Paul Price MD  45.5  Marketing  42862.000000

   Joining_Date  is_resigned  years_in_company
0    2024-06-09        False                 0
1    2018-02-07        False                 6
2    2019-01-11        False                 6
3    2019-09-26        False                 5
4    2020-02-09        False                 4
..          ...          ...               ...
95   2017-08-13         True                 7
96   2018-11-18        False                 6
97   2018-07-14        False                 6
98   2022-10-20         True                 2
99   2017-12-27        False                 7

[100 rows x 8 columns]

In [33]:
#2
#Save only the following columns to a new DataFrame: Employee_ID, Name, Age, Department, Salary, and YearsInCompany.
new_df = df[['Employee_ID', 'Name', 'Age', 'Department', 'Salary', 'years_in_company']]
print(new_df)

    Employee_ID               Name   Age Department        Salary  \
0          1001        Steven Dunn  30.0         IT  51530.600000
1          1002    Jennifer Romero  54.0         IT  47943.500000
2          1003         Dana Haney  59.0    Finance  59643.923913
3          1004       Louis Powers  60.0    Finance  58094.000000
4          1005   Jennifer Gilmore  54.0  Marketing  80848.000000
..          ...                ...   ...        ...           ...
95         1096        John Walton  28.0         IT  57641.100000
96         1097  Matthew Alexander  25.0         IT  67343.100000
97         1098         Kelly Cole  25.0         HR  69045.000000
98         1099     Melissa Harper  52.0         IT  67766.600000
99         1100      Paul Price MD  45.5  Marketing  42862.000000

    years_in_company
0                  0
1                  6
2                  6
3                  5
4                  4
..               ...
95                 7
96                 6
97                 6
98                 2
99                 7

[100 rows x 6 columns]

In [34]:
#3
#Sort the data by JoiningDate in descending order. 
sorting= df.sort_values(by='Joining_Date', ascending= False)
print(sorting)

    Employee_ID                Name   Age Department   Salary Joining_Date  \
72         1073    Stephanie Hanson  45.5         IT  94227.1   2024-11-25
59         1060     Holly Rodriguez  41.0         HR  85452.0   2024-10-09
33         1034         April Yoder  55.0    Finance  53113.0   2024-07-20
28         1029       Lauren Santos  50.0         HR  41990.0   2024-06-20
0          1001         Steven Dunn  30.0         IT  51530.6   2024-06-09
..          ...                 ...   ...        ...      ...          ...
6          1007        Thomas Lopez  39.0         HR  66678.0   2015-05-24
17         1018        Bryan Golden  30.0    Finance  78126.0   2015-05-07
19         1020      Robert Jackson  30.0  Marketing  48234.0   2015-03-14
8          1009          Lori Short  56.0         IT  64432.5   2015-02-28
63         1064  Elizabeth Thompson  56.0    Finance  72278.0   2015-01-28

    is_resigned  years_in_company
72         True                 0
59        False                 0
33        False                 0
28         True                 0
0         False                 0
..          ...               ...
6         False                 9
17        False                 9
19         True                 9
8          True                 9
63         True                 9

[100 rows x 8 columns]

In [35]:
# cleaned_employees.json in JSON format
df.to_json('cleaned_employees.json', orient='records', lines=True)